//班上有8位同學，他們進行了6次考試結果如下：
//		1號	2號	3號	4號	5號	6號	7號	8號
//	1考	10	35	40	100	90	85	75	70
//	2考	37	75	77	89	64	75	70	95
//	3考	100	70	79	90	75	70	79	90
//	4考	77	95	70	89	60	75	85	89
//	5考	98	70	89	90	75	90	89	90
//	6考	90	80	100	75	50	20	99	75
//請算出每位同學考最高分的次數
//(提示：二維陣列)

package hw4;

import java.util.Arrays;

public class Hw4_06 {
	
	public static void main(String[] args) {
		
		int[][] total = { 	{ 10, 35, 40, 100, 90, 85, 75, 70 }, 
							{ 37, 75, 77, 89, 64, 75, 70, 95 },
							{ 100, 70, 79, 90, 75, 70, 79, 90 }, 
							{ 77, 95, 70, 89, 60, 75, 85, 89 },
							{ 98, 70, 89, 90, 75, 90, 89, 90 }, 
							{ 90, 80, 100, 75, 50, 20, 99, 75 } };
		int[] a = new int[8];
		int[] max = new int[6];
		int count = 0;
		
		//先找出每次考試最高分的分數(橫的找)
		for (int i = 0; i < 6; i++) {		//i代表6次考試
			for (int j = 0; j < 8; j++) 	//j代表8位同學
				a[j] = total[i][j];			//依序讓a陣列放入每次的考試成績
			Arrays.sort(a);					//進行排序後，a[7]為最大值放入max
			max[i] = a[7];					//最後max會放入6次考試，當次最高分的成績
		}
		
		//再找出當次最高分的同學(直的找)
		for (int i = 0; i < 8; i++) {		
			for (int j = 0; j < 6; j++) {
				if (total[j][i] == max[j])	//如果第i位同學的第j次考試 = 最高分(max[j])
					count++;				//則計數器+1
			}
			System.out.println((i + 1) + "號同學，最高分有 " + count + "次");
			count = 0;						//計數器歸0，計算下一位同學
		}
	}
}
